{"meta":{"title":"毛毛爆爆","subtitle":7299,"description":"约定未来 , 不忘初心 !","author":"Chen Yu","url":"https://www.mmbbao.com"},"pages":[{"title":"Application","date":"2018-09-25T14:24:30.000Z","updated":"2018-10-19T17:17:58.000Z","comments":true,"path":"Application/index.html","permalink":"https://www.mmbbao.com/Application/index.html","excerpt":"","text":""},{"title":"毛毛爆爆","date":"2018-02-15T12:20:20.000Z","updated":"2018-10-19T17:17:58.000Z","comments":true,"path":"Love/index.html","permalink":"https://www.mmbbao.com/Love/index.html","excerpt":"","text":"​ ​ 爱是巧遇，也是默契； 爱是神秘，也是坦白； 爱是沸腾，也是平静； 爱是过去，也是永远； 爱是爱情，更是亲情； 爱与被爱，伴你前行； 约定未来，不忘初心！ 我希望某一天醒来，你与阳光同在。"},{"title":"个人简历","date":"2018-09-12T07:15:00.000Z","updated":"2018-10-19T17:17:58.000Z","comments":true,"path":"about/index.html","permalink":"https://www.mmbbao.com/about/index.html","excerpt":"","text":"联系方式 手机：181 * * * * * 299 Email：chenyu.cccc@live.com QQ/微信号：28996226 个人信息 陈钰 / 男 / 1996 专科 / 四川建筑职业技术学院-机电与信息工程系-电气自动化专业 微博：@陳鈺-7299 技术博客：https://www.mmbbao.com Github：https://github.com/MMBBao 校内职务 系党支部入党积极分子 系党支部干事 院社联活动部干事 工作经历手机测评机构 （ 2015年4月 ~ 2017年10月 ）软件测评我在此项目主要负责手机系统测试修复，软件问题检测，协助开发者修复bug 四川富森美工地 （ 2015年7月 ~ 2015年8月 ）资料员主要负责工地资料收集整理 德阳旌湖宾馆 （ 2018年7月 ~ 2018年8月 ）礼宾员主要负责行李寄存,大厅客人引导的工作 技能清单以下均为我熟练使用的技能 电子类 精通 Windows XP / 7 / 10 等计算机操作系统 熟悉 Office 熟悉 AutoCAD 熟悉 Altium Designer 2013 ( AD13) 使用 C语言编写简单的小程序 专业类 建筑专业材料工 建筑专业测量工 建筑专业钢筋工 能力证明技能证书 现已取得 钢筋工 证书 现已取得 材料工 证书 现已取得 测量工 证书 现已取得 计算机初级 证书 现已取得 AutoCAD 证书 荣誉证书 四川建筑职业技术学院2017-2018学年第二学期 三等奖学金获得者 2017年秋期荣获四川建筑职业技术学院 活动积极分子称号 荣获成都铁路工程学校2013-2014学年第一学期 社团活动奖 荣获成都铁路工程学校2013-2014学年第二学期 优秀团员称号 荣获成都铁路工程学校2014-2015学年第一学期 优秀青年称号 荣获成都铁路工程学校2014-2015学年第二学期 道德标兵奖 荣获成都铁路工程学校2015-2016学年第一学期 道德标兵奖 荣获成都铁路工程学校2015-2016学年第二学期 道德标兵奖 个人总结 在生活上，我独立自主，养成良好习惯,并乐助人,关心他人，与舍友、同班同学保持良好的关系，并结识一些高年级的学长，向其请教学习、工作、生活上的问题。 在工作上，积极主动，工作踏实，责任心强，具有良好的组织交际能力，注重团队协作精神，组织协调其他学生干部顺利的完成各项工作。 我个人认为自己最大的缺点就是喜欢一心两用甚至多用，急功近利，喜欢一口气学许多东西，但是贪多嚼不烂，即使最后都能学会，也已经搞得自己很疲劳。如今想想，这样其实并不好，正所谓贵在精而不在广。 我常常提醒自己注意自身缺点，加以改正。 致谢感谢您花时间阅读我的简历，期待能有机会和您共事。​"}],"posts":[{"title":"让你的苹果设备更安全，现在你应当开启「双重认证」","slug":"让你的苹果设备更安全，现在你应当开启「双重认证」","date":"2018-08-23T00:08:00.000Z","updated":"2018-10-19T17:17:58.000Z","comments":true,"path":"uncategorized/让你的苹果设备更安全，现在你应当开启「双重认证」/","link":"","permalink":"https://www.mmbbao.com/uncategorized/让你的苹果设备更安全，现在你应当开启「双重认证」/","excerpt":"","text":"「双重认证」不是「两步验证」 早在 2013 年，苹果便为 Apple ID 增加了「两步验证（Two-Step）」的功能：登录账号时，在验证账号密码的基础上，系统还将发送验证码到用户选择的「受信任设备」进行二次认证。这项功能无疑大大提升了 Apple ID 的安全性。此前出现的数次 Apple ID 被盗等安全事件，无疑都凸现了「两步验证」对帐号安全的重要性。 在两年后的 WWDC 2015 上，苹果推出了「两步验证」的升级版——双重认证（Two-factor authentication），并承诺会带来更好的用户体验。 此前「双重认证」已内置于 iOS 9 和 OS X El Capitan 中，但直到近期 iOS 9.3 和 OS X 10.11.4 的发布，「双重认证」才正式向所有用户开放。 那么，这个「双重认证」与「两步验证」有什么区别？以及我们要如何开启它？这篇文章为你详细解答。 「双重认证」与「两步验证」的区别尽管两种验证方式大致原理相同，它们在具体的实现方式上仍然有着显著的差异。 开通途径 「两步验证」只能在 Apple ID 的管理页面开通。 「双重认证」则只能在 iOS 9.3 或 OS X 10.11.4 的 iCloud 账户管理页面中开通。 设备注册方式以下两种方式都要求手动验证「受信任电话号码」。 在开通「两步验证」时，系统将会要求你单独发送验证码到每台开启了「查找我的 iPhone」的 iOS 设备上，才能将对应设备设为「受信任设备」，并使用它们来接收验证码。 在开通「双重认证」时，系统会自动将所有登录了 iCloud 的设备设为「受信任设备」。 恢复密钥 「两步验证」会生成一串「恢复密钥」作为恢复账户访问权限的后备手段。 「双重认证」不会生成任何恢复密钥。 验证过程在未受信任的设备或浏览器上登录 Apple ID 时，两种验证方式都会要求输入额外的验证码确认身份。 输入账户密码后，「两步验证」会要求你选择一台「受信任设备」或者「受信任电话号码」接收一串四位数的验证码。 「双重认证」则会自动向所有的「受信任设备」发送登录提醒，你也可以手动选择使用手机号码来接收验证码。与「两步验证」不同的是，登录提醒不仅仅包含验证码，还会显示账号登录的大致地理位置，验证码的长度也从四位延长到了六位。 用户可以在任一设备上选择是否允许此次登录尝试，选择「允许」系统将会自动展示六位数验证码，「不允许」则会直接拒绝此次登录。在一台设备上选择后，其他设备上的登录提醒将会自动消失。 接收验证码的设备 「两步验证」只能向 iOS 设备发送验证码。 「双重认证」既可以向 iOS 设备发送验证码，也可以发送给 Mac。 离线状态下的使用 在所有「受信任设备」和「受信任电话号码」离线时，「两步验证」将无法使用，这可能会给你的登录带来麻烦。 而「双重认证」可以在「受信任设备」上离线生成验证码，大大简化了用户体验。 如果要在安装 iOS 9 和 OS X El Capitan 之前版本的设备上登录 Apple ID，你需要手动生成验证码，并在旧款设备的密码栏内输入账户密码，后跟六位生成的验证码。 安全信息的更改 开通了「两步验证」，你只能在 Apple ID 内修改包括「受信任设备」在内的安全信息。 「双重认证」则可以让你在设备端的账号管理页面直接修改。 忘记密码后的处理 「两步验证」要求你拥有账户密码、恢复密钥、一台可接收验证码的「受信任设备」中的任意两样才能访问 Apple ID。一旦丢失这三样中的任意两样，你将永久性失去 Apple ID 的访问权限。 「双重认证」没有恢复密钥。在你忘记密码，也不能使用「受信任设备」和「受信任电话号码」时，你还可以使用「账户恢复」并提交有关信息给苹果进行审核，尝试重新获得账户的访问权限。苹果技术支持无权干涉「账户恢复」的流程，一定程度上杜绝了「内鬼」作崇。 开启「双重认证」你需要在任意一台升级到 iOS 9.3 或 OS X 10.11.4 或更新版本的设备上开通「双重认证」服务，此后使用此 iCloud 账户的所有设备均会自动开启该服务。 在 iOS 上的操作步骤 如果你已经设置了「两步验证」，你需要登录 Apple ID 管理页面 取消它。 前往「设置」- 「iCloud」，点击顶部的 Apple ID，选择「密码与安全性」- 「设置双重认证」。 按步骤指引打开「双重认证」。 开启「双重认证」后的状态： 在 Mac 上的操作步骤 同样的，如果你此前有开通「两部验证」服务，你需要登录 Apple ID 管理页面 关闭它。 在「系统偏好设置」中选择「iCloud」，并点击「账户详细信息」。 在「账户详细信息」中选择「双重认证」选项，之后的操作步骤和 iOS 版基本相同。 一句话总结「两步验证」更像是临时解决方案，它借用「查找我的 iPhone」消息显示功能来发送验证码。而「双重认证」则是预先植入在系统内的功能，能显示正在登录的地理位置，体验更优秀，也更安全。 「双重认证」是比「两步验证」更好的验证方式，是后者的升级版，理解这一点就可以了。所以，我们强烈建议每个用户都尽可能将 Apple ID 升级开启「双重认证」，以避免潜在的帐号安全风险。","categories":[],"tags":[{"name":"iOS","slug":"iOS","permalink":"https://www.mmbbao.com/tags/iOS/"},{"name":"Apple","slug":"Apple","permalink":"https://www.mmbbao.com/tags/Apple/"},{"name":"双重验证","slug":"双重验证","permalink":"https://www.mmbbao.com/tags/双重验证/"}]},{"title":"教程：如何开启Apple ID两步验证,预防隐私泄露","slug":"教程：如何开启Apple ID两步验证,预防隐私泄露","date":"2018-07-23T09:08:00.000Z","updated":"2018-10-19T17:17:58.000Z","comments":true,"path":"uncategorized/教程：如何开启Apple ID两步验证,预防隐私泄露/","link":"","permalink":"https://www.mmbbao.com/uncategorized/教程：如何开启Apple ID两步验证,预防隐私泄露/","excerpt":"","text":"近期的两拨好莱坞影星艳照泄漏事件再一次将 iCloud 安全问题推到了风口浪尖。外界普遍质疑该事件为 iCloud 账户被黑客暴力破解。那么对于用户来说，有没有相关的防范措施才预防甚至避免隐私泄露这种事情发生呢？其实苹果公司在安全和隐私这一方面做得已经够好了，本篇文章将会介绍如何启用 Apple ID 两步验证，来使得自己的 Apple ID 账户更安全。 启用 Apple ID 两步验证第一步：打开 Safari 浏览器，前往 Apple ID 管理页面。点击「管理您的 Apple ID」按钮。 第二步：登录自己的账户后，选择左栏的「密码和账户安全」选项，点击「两步验证」链接。 第三步：点选「继续」按钮继续。 此处开始验证你的身份。 注：开启 Apple ID 两步验证后，以后每次更改账户信息，都需要通过短信进行验证你的身份。 第四步：添加短信验证的号码，Apple 将进行短信确认，点击「下一步」继续。 第五步：输入刚刚收到的 4 位数字验证码来验证你的身份。 验证完毕，此时开始启用两步验证。 第六步：你可以继续添加其它电话号码；点击设备名称后面的「验证」选项来添加自己的设备。验证完毕后点击「继续」按钮继续。 第七步：在刚刚添加过号码的手机上读取验证码，输入「验证设备」窗口内来验证自己的 iOS 设备。 验证设备完毕后在该设备名称后将会出现「已验证」标签。 第八步：生成恢复密钥（此密钥非常重要），你可以将其打印出来保存（笔者同时还在 1Password 里面保存了一份）。接着点击「继续」按钮继续。 第九步：输入恢复密钥确认自己的身份。点击「继续」按钮确认。 第十步：选择复选框后，点击「启用两步验证」按钮来启用。 网页将弹出「成功启用两步验证」的消息页面。 至此你的 iCloud 账户已经成功启用两步验证机制。启用 Apple ID 账户两步验证后，用户在登录管理 Apple ID 账户的网页时，既要输入原本的 Apple ID 密码，又要输入一个动态验证码（iCloud 将会把验证码发送到你先前设置绑定的手机号码的设备上），这样一来，即可大大提升你的 Apple ID 账户的安全性。","categories":[],"tags":[{"name":"iOS","slug":"iOS","permalink":"https://www.mmbbao.com/tags/iOS/"},{"name":"Apple","slug":"Apple","permalink":"https://www.mmbbao.com/tags/Apple/"},{"name":"两步验证","slug":"两步验证","permalink":"https://www.mmbbao.com/tags/两步验证/"}]}]}